In [175]:
import pandas as pd

In [229]:
df1 = pd.read_csv('./data/location_ref/citynamemulti_councode_cityco.csv')
df1 = df1.drop(columns=['city', 'country'])
df1.head()

,city,country,language,cityLabel,alpha2Code,cityCoords
0,http://www.wikidata.org/entity/Q26175,http://www.wikidata.org/entity/Q214,nn,Trnava,SK,Point(17.586211111 48.37775)
1,http://www.wikidata.org/entity/Q26175,http://www.wikidata.org/entity/Q214,pl,Trnawa,SK,Point(17.586211111 48.37775)
2,http://www.wikidata.org/entity/Q26175,http://www.wikidata.org/entity/Q214,ps,ترناوا,SK,Point(17.586211111 48.37775)
3,http://www.wikidata.org/entity/Q26175,http://www.wikidata.org/entity/Q214,ro,Trnava,SK,Point(17.586211111 48.37775)
4,http://www.wikidata.org/entity/Q26175,http://www.wikidata.org/entity/Q214,rue,Тырнава,SK,Point(17.586211111 48.37775)

In [196]:
df1.shape  # 1122238

(1147454, 4)

In [177]:
df2 = pd.read_csv('./data/location_ref/cityco_citypop.csv')
df2 = df2.drop(columns=['city', 'cityLabel'])
df2 = df2.drop_duplicates() # remove duplicates
df2.head()

                         cityCoords population
0        Point(14.333333 41.066667)      75561
1                  Point(31.6 4.85)     372410
2          Point(39.283333333 -6.8)    4715000
3          Point(32.52654 15.60308)    5345000
4  Point(10.992777777 45.438611111)     252520

In [178]:
df2.shape

(24372, 2)

In [179]:
df1['cityCoords'].nunique()

28046

In [180]:
df_co = pd.DataFrame(df1['cityCoords'].unique())
df_co = df_co.rename(columns = {0: 'cityCoords'})
df_co.shape

(28046, 1)

In [181]:
### remove all the city coordinates that do not appear in the other list
df3 = df2.merge(df_co, how='inner', on='cityCoords',suffixes=(False, False))
#df3 = df3.dropna()
df3.shape

(24351, 2)

In [182]:
ll = df3['cityCoords'].to_list()
len(ll)

24351

In [188]:
inverse_boolean_series = ~(df4.cityCoords).isin(df3.cityCoords)
inverse_filtered_df = df4.cityCoords[inverse_boolean_series]
inverse_filtered_df.shape

(21,)

In [220]:
df6 = df4[df4['cityCoords'].isin(ll)]
df6.shape

(24351, 2)

In [221]:
df1 = df1[df1['cityCoords'].isin(ll)]
df1.shape

(1024614, 4)

In [222]:
df1['cityCoords'].nunique()  # left 28046 right 21859

21859

### Merge to final df

In [223]:
df = df1.merge(df6, how='right', on='cityCoords',suffixes=(False, False))
df.shape

(1122238, 5)

In [224]:
df['cityCoords'].nunique()  # left 28046 right 21859

21859

In [225]:
df.head()

  language cityLabel alpha2Code                    cityCoords population
0       nn    Trnava         SK  Point(17.586211111 48.37775)      65382
1       pl    Trnawa         SK  Point(17.586211111 48.37775)      65382
2       ps    ترناوا         SK  Point(17.586211111 48.37775)      65382
3       ro    Trnava         SK  Point(17.586211111 48.37775)      65382
4      rue   Тырнава         SK  Point(17.586211111 48.37775)      65382

In [234]:
df.to_csv('./data/location_ref/citynamemulti_councode_cityco_citypop.csv')

In [227]:
df.shape

(1122238, 5)